**王毓媛 52240313135**

In [2]:
import pandas as pd
import numpy as np
from pandas import Series,DataFrame#方便使用Series和DataFrame将其引入本地命名空间

# Series结构

## 例3.1

In [ ]:
#Series类似一维数组结构，由索引和值组成

In [8]:
#创建5名篮球运动员身高的Series结构对象height，值是身高，索引为球衣号码（数字字符串作为索引）
height = Series([187,190,185,178,185],
              index = ['13','14','7','2','9'])

In [9]:
height

13    187
14    190
7     185
2     178
9     185
dtype: int64

In [10]:
#用字典创建Series对象，将字典的key作为索引：
height = Series({'13':187,'14':190,'7':185,'2':178,'9':185})

In [11]:
height

13    187
14    190
7     185
2     178
9     185
dtype: int64

## 例题3-2 ：使用例3-1创建的球员身高Series对象，实现球员数据的查询、增加、删除和修改。

### 查找操作

In [12]:
#查询球员身高
height['13'] #同height[[0]]

187

In [14]:
height[[1,3,0]] #同height['14','2','13']

C:\Users\Administrator\AppData\Local\Temp\ipykernel_3096\2714172060.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  height[[1,3,0]] #同height['14','2','13']

14    190
2     178
13    187
dtype: int64

In [16]:
height[1:4]  #查找标签序号为1-4的球员身高，序号从0开始，不包括4

14    190
7     185
2     178
dtype: int64

In [19]:
height[height.values >= 186] #查找身高高于186的球员

13    187
14    190
dtype: int64

### 修改操作

In [22]:
#修改球员身高
height[[0]]= 188 #同height['13'] = 188

C:\Users\Administrator\AppData\Local\Temp\ipykernel_3096\1672265165.py:2: FutureWarning: Series.__setitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To set a value by position, use `ser.iloc[pos] = value`
  height[[0]]= 188

In [23]:
height [0]

C:\Users\Administrator\AppData\Local\Temp\ipykernel_3096\2668128579.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  height [0]

188

In [24]:
height[1:3] = 201 #修改序号下标1-2的球员身高为201，不包4，下标从0开始

In [25]:
height

13    188
14    201
7     201
2     178
9     185
dtype: int64

### 增加数据

#### Series不能直接添加新数据，append()函数将两个Series拼接产生一个新的Series不改变原Series

In [30]:
height2 = Series([197,199],
                 index = ['23','5'])

In [31]:
new_height = height._append(height2)
#注：这里原来使用.append()会报错显示Series没有append模块，是pandas版本的问题，改成._append()即可解决问题

In [32]:
new_height

13    188
14    201
7     201
2     178
9     185
23    197
5     199
dtype: int64

### 删除数据

In [33]:
new_height = height.drop(['13','9'])

In [34]:
new_height

14    201
7     201
2     178
dtype: int64

In [35]:
height #删除不改变原结构对象中的数据

13    188
14    201
7     201
2     178
9     185
dtype: int64

In [37]:
new_height = height.drop(['13','9'],inplace = True) #加上inplace = True即可删除原对象中的数据

In [38]:
height

14    201
7     201
2     178
dtype: int64

In [ ]:
heigh.drop(heigh.index[1:4],inplace = True) #可以直接修改原Series而不创建新的对象

### 修改索引值

In [40]:
height.index = [2,1,211]  #这里是数字索引

In [41]:
height.iloc[0] #基于位置序号访问的方式需要使用iloc方式

201

In [42]:
height.index = ['9','8','5'] #这里是字符索引

In [45]:
height['5'] #同height.iloc[2],同height[[2]] ,注意这里是两个[[]]

178

### Series课后作业

####一、 创建并访问Series对象。
 
1）创建如下表的Series数据对象，其中a-f为索引；

2）增加数据27，索引为g；

3）修改索引d对应的值为40；

4）查询值大于27的数据；

5）删除位置为1-3的数据。

【提示】位置1-3的索引列表，可以用 series.index[1:4] 来得到。

In [65]:
afterclass_work = Series([30,25,27,41,25,34],
                        index=['a','b','c','d','e','f'])

In [66]:
afterclass_work

a    30
b    25
c    27
d    41
e    25
f    34
dtype: int64

In [67]:
#增加数据27，索引为g；
afterclass_work2=Series([27],
                        index = ['g'])
new_afterclassw = afterclass_work._append(afterclass_work2)

In [68]:
new_afterclassw

a    30
b    25
c    27
d    41
e    25
f    34
g    27
dtype: int64

In [69]:
#修改索引d对应的值为40
afterclass_work['d'] = 40

In [70]:
afterclass_work['d']

40

In [71]:
#查询值大于27的数据
afterclass_work[afterclass_work.values > 27]

a    30
d    40
f    34
dtype: int64

In [73]:
#删除位置1-3的数据
afterclass_work.drop(afterclass_work.index[1:4],inplace = True)

In [76]:
afterclass_work

a    30
e    25
f    34
dtype: int64

# DataFrame结构

### DataFrame 创建方法：

DataFrame ( data，index = […]，columns=[…] )
 
data：列表或NumPy的二维ndarray对象

index，colunms：列表，若省略则自动生成0 ~n-1的序号标签

## 例题3-3

### 创建DataFrame对象

In [78]:
#students记录3名学生的信息 行索引为数字序号；列索引为age、weight和height
data = [[19,170,68],[20,165,65],[18,175,65]] #创建一个二维数组，data列表的每个元素初始化为DataFrame的一行值
students = DataFrame(data,
                     index = [1,2,3],
                     columns = ['age','height','weight'])

In [79]:
students

   age  height  weight
1   19     170      68
2   20     165      65
3   18     175      65

### 查找操作

In [80]:
#学生信息查询
students.loc[1,'age'] #查找1号学生的年龄

19

In [82]:
students.loc[[1,3],['age','height']] #查找1,3号学生的年龄和身高,使用索引名查询

   age  height
1   19     170
3   18     175

In [83]:
students.iloc[[0,2],[0,1]] #查找第0,2行，和第0,1列的值，使用位置序号查询

   age  height
1   19     170
3   18     175

In [84]:
students.loc[:,['age','weight']] #“：”表示查询所有行的数据

   age  weight
1   19      68
2   20      65
3   18      65

In [87]:
students[['height','weight'] ]#查询所有人的身高和体重

   height  weight
1     170      68
2     165      65
3     175      65

In [89]:
students.iloc[1:,0:2] #通过切片方式抽取第1行之后的所有元素+0-1列

   age  height
2   20     165
3   18     175

In [90]:
students[1:3] #抽取第1-2行数据，列的"："可以省略不写

   age  height  weight
2   20     165      65
3   18     175      65

#### 筛选数据

In [91]:
#筛选身高高于168的同学，并显示其身高体重
mask = students['height'] >= 168

In [92]:
mask

1     True
2    False
3     True
Name: height, dtype: bool

In [93]:
students.loc[mask,['height','weight']] #mask对象索引的第二行值为false，因此未被选中

   height  weight
1     170      68
3     175      65

### 增加数据 ，增加学生信息
Dataframe对象可以增加新的列，但是不能直接增加新的行，增加行需要将两个DataFrame对象合并实现

In [94]:
#列索引标签不存在：添加新列
#列索引标签存在：修改列值

students['expense'] = [1500,1600,1200] #增加学生月消费数据
students

   age  height  weight  expense
1   19     170      68     1500
2   20     165      65     1600
3   18     175      65     1200

In [96]:
students['expense'] = [2500,2600,2200] #修改学生月消费数据
students

   age  height  weight  expense
1   19     170      68     2500
2   20     165      65     2600
3   18     175      65     2200

## 修改数据，修改学生信息

In [98]:
students['weight'] = 70 #整列的所有体重都改为70
students

   age  height  weight  expense
1   19     170      70     2500
2   20     165      70     2600
3   18     175      70     2200

In [99]:
students.loc[1,:] = [21,188,88,2000] #修改1号学生的数据，因为列的“：”可以不写，所以同students.loc[1] = [21,188,88,2010]
students

   age  height  weight  expense
1   21     188      88     2000
2   20     165      70     2600
3   18     175      70     2200

In [101]:
#筛选不合理信息+重新赋值
students.loc[students['expense']>2500,'expense'] = 2500
students

   age  height  weight  expense
1   21     188      88     2010
2   20     165      70     2500
3   18     175      70     2200

### 删除数据
xxx.drop(索引,axis=0) #删除行
xxx.drop('索引',axis = 1) #删除列
xxx.drop(索引,axis=0/1,inplace= True) #删除原数据对象

In [104]:
#删除一行元素
students.drop(1,axis=0) #axis=0表示行,缺省，不修改原始数据对象,同students.drop(1)

   age  height  weight  expense
2   20     165      70     2500
3   18     175      70     2200

In [106]:
#删除一列数据
students.drop('expense',axis=1) #删除月消费那一列，axis=1表示列

   age  height  weight
1   21     188      88
2   20     165      70
3   18     175      70

In [108]:
#删除多行数据
students.drop([1,2]) #axis=0

   age  height  weight  expense
3   18     175      70     2200

In [114]:
#删除原始数据
students.drop(['age','weight'],axis = 1,inplace = True)

In [115]:
students

   height  expense
1     188     2010
2     165     2500
3     175     2200

## 课后作业

####1. 创建并访问DataFrame对象。

a) 创建3×3DataFrame数据对象：数据内容为1-9；行索引为字符a，b，c；

列索引为字符串one，two，three；

b) 查询列索引为two和three两列数据；

c) 查询第0行、第2行、第0列、第2列数据；

d) 筛选第1列中值大于2的所有行数据，另存为data1对象；

e) 为data1添加一列数据，列索引为four，值都为10；

f) 将data1所有值大于9的数据修改为8；

g) 删除data1中第0行和第1行数据。

【提示】

1）生成数据，使用numpy的arange()函数和reshape()函数；

2）使用 data>9生成布尔型的DataFrame，用于整个DataFrame的数据过滤

In [120]:
#a) 创建3×3DataFrame数据对象：数据内容为1-9；行索引为字符a，b，c；列索引为字符串one，two，three；
data1 = [[1,2,3],[4,5,6],[7,8,9]]
afterclass_df = DataFrame(data,
                          index = ['a','b','c'],
                          columns = ['one','two','three'])
afterclass_df

   one  two  three
a   19  170     68
b   20  165     65
c   18  175     65

In [122]:
#b) 查询列索引为two和three两列数据；
afterclass_df[['two','three']]

   two  three
a  170     68
b  165     65
c  175     65

In [123]:
#c) 查询第0行、第2行、第0列、第2列数据；
afterclass_df.iloc[[0,2],[0,2]]

   one  three
a   19     68
c   18     65

In [134]:
#d) 筛选第1列中值大于2的所有行数据，另存为data1对象；
data1 = afterclass_df[afterclass_df['one']>2] #使用列名筛选
#同data1=afterclass_df[afterclass_df.iloc[:,0]>2]
data1

   one  two  three
a   19  170     68
b   20  165     65
c   18  175     65

In [135]:
#e) 为data1添加一列数据，列索引为four，值都为10；
data1['four'] = 10
data1

   one  two  three  four
a   19  170     68    10
b   20  165     65    10
c   18  175     65    10

In [ ]:
#f) 将data1所有值大于9的数据修改为8；
#使用df.where()
data1 = data1.where(data <= 9,8) #data1<=9返回一个bool形dataframe，Ture保留原值，false位置替换为8

In [136]:
#使用df.mask()
data1 = data1.mask(data1 >9,8)

In [137]:
data1

   one  two  three  four
a    8    8      8     8
b    8    8      8     8
c    8    8      8     8

In [140]:
#g) 删除data1中第0行和第1行数据。
data1.drop(['a','b'],axis=0)

   one  two  three  four
c    8    8      8     8